<a href="https://colab.research.google.com/github/christinezuzart/Learning/blob/main/Pandas_Refresher.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("/content/sample_data/california_housing_train.csv")

In [3]:
df

       longitude  latitude  ...  median_income  median_house_value
0        -114.31     34.19  ...         1.4936             66900.0
1        -114.47     34.40  ...         1.8200             80100.0
2        -114.56     33.69  ...         1.6509             85700.0
3        -114.57     33.64  ...         3.1917             73400.0
4        -114.57     33.57  ...         1.9250             65500.0
...          ...       ...  ...            ...                 ...
16995    -124.26     40.58  ...         2.3571            111400.0
16996    -124.27     40.69  ...         2.5179             79000.0
16997    -124.30     41.84  ...         3.0313            103600.0
16998    -124.30     41.80  ...         1.9797             85800.0
16999    -124.35     40.54  ...         3.0147             94600.0

[17000 rows x 9 columns]

In [4]:
df.shape

(17000, 9)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17000 entries, 0 to 16999
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   longitude           17000 non-null  float64
 1   latitude            17000 non-null  float64
 2   housing_median_age  17000 non-null  float64
 3   total_rooms         17000 non-null  float64
 4   total_bedrooms      17000 non-null  float64
 5   population          17000 non-null  float64
 6   households          17000 non-null  float64
 7   median_income       17000 non-null  float64
 8   median_house_value  17000 non-null  float64
dtypes: float64(9)
memory usage: 1.2 MB

In [6]:
df.head()

   longitude  latitude  ...  median_income  median_house_value
0    -114.31     34.19  ...         1.4936             66900.0
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0
3    -114.57     33.64  ...         3.1917             73400.0
4    -114.57     33.57  ...         1.9250             65500.0

[5 rows x 9 columns]

In [7]:
df.head(10)

   longitude  latitude  ...  median_income  median_house_value
0    -114.31     34.19  ...         1.4936             66900.0
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0
3    -114.57     33.64  ...         3.1917             73400.0
4    -114.57     33.57  ...         1.9250             65500.0
5    -114.58     33.63  ...         3.3438             74000.0
6    -114.58     33.61  ...         2.6768             82400.0
7    -114.59     34.83  ...         1.7083             48500.0
8    -114.59     33.61  ...         2.1782             58400.0
9    -114.60     34.83  ...         2.1908             48100.0

[10 rows x 9 columns]

In [8]:
df.tail(10)

       longitude  latitude  ...  median_income  median_house_value
16990    -124.22     41.73  ...         1.7038             78300.0
16991    -124.23     41.75  ...         2.4805             73200.0
16992    -124.23     40.81  ...         3.3462             50800.0
16993    -124.23     40.54  ...         3.0806            106700.0
16994    -124.25     40.28  ...         1.9417             76100.0
16995    -124.26     40.58  ...         2.3571            111400.0
16996    -124.27     40.69  ...         2.5179             79000.0
16997    -124.30     41.84  ...         3.0313            103600.0
16998    -124.30     41.80  ...         1.9797             85800.0
16999    -124.35     40.54  ...         3.0147             94600.0

[10 rows x 9 columns]

# Creating dataframes from dictionaries

In [9]:
people = {'first':['Mary', 'John', "Tiya"],
          'last':['Turner', 'Doe', 'Roza']}

In [10]:
df = pd.DataFrame(people)

In [11]:
df

  first    last
0  Mary  Turner
1  John     Doe
2  Tiya    Roza

In [12]:
df['last']

0    Turner
1       Doe
2      Roza
Name: last, dtype: object

In [13]:
type(df['last'])

pandas.core.series.Series

# Using [ ] is preferable over '.' it may happen to access the method

In [14]:
df.last

<bound method NDFrame.last of   first    last
0  Mary  Turner
1  John     Doe
2  Tiya    Roza>

In [15]:
df[['last', 'first']]

     last first
0  Turner  Mary
1     Doe  John
2    Roza  Tiya

In [16]:
df.columns

Index(['first', 'last'], dtype='object')

# Accessing rows by integer location

### Here indexes are the column names

In [17]:
df.iloc[0]

first      Mary
last     Turner
Name: 0, dtype: object

# Accesing multiple rows

In [18]:
df.iloc[[0,2]]

  first    last
0  Mary  Turner
2  Tiya    Roza

In [19]:
df.iloc[[0,2], 1]

0    Turner
2      Roza
Name: last, dtype: object

#Accessing rows by labels

In [20]:
df.loc[0]

first      Mary
last     Turner
Name: 0, dtype: object

In [21]:
df.loc[[0,1]]

  first    last
0  Mary  Turner
1  John     Doe

In [22]:
df.loc[[0,1],'last']

0    Turner
1       Doe
Name: last, dtype: object

In [23]:
df.loc[[0,1],['last', 'first']]

     last first
0  Turner  Mary
1     Doe  John

In [24]:
sample = {'Hobby':['Y', 'N', 'Y', 'N', 'Y', 'N', 'Y', 'N', 'Y', 'N', 'Y', 'N','N', 'N']}

In [25]:
df_sample = pd.DataFrame(sample)

In [26]:
df_sample['Hobby']

0     Y
1     N
2     Y
3     N
4     Y
5     N
6     Y
7     N
8     Y
9     N
10    Y
11    N
12    N
13    N
Name: Hobby, dtype: object

In [27]:
df_sample['Hobby'].value_counts()

N    8
Y    6
Name: Hobby, dtype: int64

In [28]:
df = pd.read_csv("/content/sample_data/california_housing_train.csv")

In [29]:
df

       longitude  latitude  ...  median_income  median_house_value
0        -114.31     34.19  ...         1.4936             66900.0
1        -114.47     34.40  ...         1.8200             80100.0
2        -114.56     33.69  ...         1.6509             85700.0
3        -114.57     33.64  ...         3.1917             73400.0
4        -114.57     33.57  ...         1.9250             65500.0
...          ...       ...  ...            ...                 ...
16995    -124.26     40.58  ...         2.3571            111400.0
16996    -124.27     40.69  ...         2.5179             79000.0
16997    -124.30     41.84  ...         3.0313            103600.0
16998    -124.30     41.80  ...         1.9797             85800.0
16999    -124.35     40.54  ...         3.0147             94600.0

[17000 rows x 9 columns]

In [30]:
df.loc[0,'total_rooms']

5612.0

In [31]:
df.loc[[0,1,2],'total_rooms']

0    5612.0
1    7650.0
2     720.0
Name: total_rooms, dtype: float64

#Slicing

In [32]:
df.loc[0:2,'total_rooms']

0    5612.0
1    7650.0
2     720.0
Name: total_rooms, dtype: float64

In [33]:
df.loc[0:2,'total_rooms': 'median_income']

   total_rooms  total_bedrooms  population  households  median_income
0       5612.0          1283.0      1015.0       472.0         1.4936
1       7650.0          1901.0      1129.0       463.0         1.8200
2        720.0           174.0       333.0       117.0         1.6509

In [34]:
df.set_index('total_rooms')

             longitude  latitude  ...  median_income  median_house_value
total_rooms                       ...
5612.0         -114.31     34.19  ...         1.4936             66900.0
7650.0         -114.47     34.40  ...         1.8200             80100.0
720.0          -114.56     33.69  ...         1.6509             85700.0
1501.0         -114.57     33.64  ...         3.1917             73400.0
1454.0         -114.57     33.57  ...         1.9250             65500.0
...                ...       ...  ...            ...                 ...
2217.0         -124.26     40.58  ...         2.3571            111400.0
2349.0         -124.27     40.69  ...         2.5179             79000.0
2677.0         -124.30     41.84  ...         3.0313            103600.0
2672.0         -124.30     41.80  ...         1.9797             85800.0
1820.0         -124.35     40.54  ...         3.0147             94600.0

[17000 rows x 8 columns]

In [35]:
df

       longitude  latitude  ...  median_income  median_house_value
0        -114.31     34.19  ...         1.4936             66900.0
1        -114.47     34.40  ...         1.8200             80100.0
2        -114.56     33.69  ...         1.6509             85700.0
3        -114.57     33.64  ...         3.1917             73400.0
4        -114.57     33.57  ...         1.9250             65500.0
...          ...       ...  ...            ...                 ...
16995    -124.26     40.58  ...         2.3571            111400.0
16996    -124.27     40.69  ...         2.5179             79000.0
16997    -124.30     41.84  ...         3.0313            103600.0
16998    -124.30     41.80  ...         1.9797             85800.0
16999    -124.35     40.54  ...         3.0147             94600.0

[17000 rows x 9 columns]

In [36]:
df.set_index('total_rooms', inplace = True)

In [37]:
df

             longitude  latitude  ...  median_income  median_house_value
total_rooms                       ...
5612.0         -114.31     34.19  ...         1.4936             66900.0
7650.0         -114.47     34.40  ...         1.8200             80100.0
720.0          -114.56     33.69  ...         1.6509             85700.0
1501.0         -114.57     33.64  ...         3.1917             73400.0
1454.0         -114.57     33.57  ...         1.9250             65500.0
...                ...       ...  ...            ...                 ...
2217.0         -124.26     40.58  ...         2.3571            111400.0
2349.0         -124.27     40.69  ...         2.5179             79000.0
2677.0         -124.30     41.84  ...         3.0313            103600.0
2672.0         -124.30     41.80  ...         1.9797             85800.0
1820.0         -124.35     40.54  ...         3.0147             94600.0

[17000 rows x 8 columns]

In [38]:
df.index

Float64Index([5612.0, 7650.0,  720.0, 1501.0, 1454.0, 1387.0, 2907.0,  812.0,
              4789.0, 1497.0,
              ...
              3003.0, 3159.0, 1112.0, 2694.0, 1430.0, 2217.0, 2349.0, 2677.0,
              2672.0, 1820.0],
             dtype='float64', name='total_rooms', length=17000)

In [39]:
df.loc[1820.0]

             longitude  latitude  ...  median_income  median_house_value
total_rooms                       ...
1820.0         -116.68     33.16  ...         2.1797            156300.0
1820.0         -117.18     34.05  ...         2.6129            137000.0
1820.0         -117.29     34.15  ...         3.2976            102600.0
1820.0         -122.13     37.87  ...        10.3713            426100.0
1820.0         -124.35     40.54  ...         3.0147             94600.0

[5 rows x 8 columns]

In [40]:
df.loc[1820.0, 'longitude']

total_rooms
1820.0   -116.68
1820.0   -117.18
1820.0   -117.29
1820.0   -122.13
1820.0   -124.35
Name: longitude, dtype: float64

In [41]:
df.reset_index(inplace=True)

In [42]:
df

       total_rooms  longitude  ...  median_income  median_house_value
0           5612.0    -114.31  ...         1.4936             66900.0
1           7650.0    -114.47  ...         1.8200             80100.0
2            720.0    -114.56  ...         1.6509             85700.0
3           1501.0    -114.57  ...         3.1917             73400.0
4           1454.0    -114.57  ...         1.9250             65500.0
...            ...        ...  ...            ...                 ...
16995       2217.0    -124.26  ...         2.3571            111400.0
16996       2349.0    -124.27  ...         2.5179             79000.0
16997       2677.0    -124.30  ...         3.0313            103600.0
16998       2672.0    -124.30  ...         1.9797             85800.0
16999       1820.0    -124.35  ...         3.0147             94600.0

[17000 rows x 9 columns]

In [43]:
df = pd.read_csv("/content/sample_data/california_housing_train.csv", index_col = 'total_rooms')

In [44]:
df.head()

             longitude  latitude  ...  median_income  median_house_value
total_rooms                       ...
5612.0         -114.31     34.19  ...         1.4936             66900.0
7650.0         -114.47     34.40  ...         1.8200             80100.0
720.0          -114.56     33.69  ...         1.6509             85700.0
1501.0         -114.57     33.64  ...         3.1917             73400.0
1454.0         -114.57     33.57  ...         1.9250             65500.0

[5 rows x 8 columns]

In [45]:
df.sort_index()

             longitude  latitude  ...  median_income  median_house_value
total_rooms                       ...
2.0            -117.79     35.21  ...         2.3750            137500.0
8.0            -122.50     37.79  ...        15.0001            500001.0
11.0           -118.44     34.28  ...         2.8750            162500.0
12.0           -122.29     37.81  ...         0.4999             67500.0
15.0           -122.37     37.60  ...         5.0480            350000.0
...                ...       ...  ...            ...                 ...
30401.0        -117.12     33.52  ...         4.5841            212300.0
30405.0        -118.78     34.16  ...         8.0137            399200.0
32054.0        -117.78     34.03  ...         6.0191            253900.0
32627.0        -121.79     36.64  ...         2.3087            118800.0
37937.0        -117.74     33.89  ...         7.4947            366300.0

[17000 rows x 8 columns]

In [48]:
df.index.value_counts()

1582.0     16
1527.0     15
1717.0     14
1471.0     14
1703.0     14
           ..
157.0       1
2760.0      1
458.0       1
10239.0     1
4068.0      1
Name: total_rooms, Length: 5533, dtype: int64

In [49]:
df.sort_index(ascending=False)

             longitude  latitude  ...  median_income  median_house_value
total_rooms                       ...
37937.0        -117.74     33.89  ...         7.4947            366300.0
32627.0        -121.79     36.64  ...         2.3087            118800.0
32054.0        -117.78     34.03  ...         6.0191            253900.0
30405.0        -118.78     34.16  ...         8.0137            399200.0
30401.0        -117.12     33.52  ...         4.5841            212300.0
...                ...       ...  ...            ...                 ...
15.0           -118.04     33.90  ...         0.4999            162500.0
12.0           -122.29     37.81  ...         0.4999             67500.0
11.0           -118.44     34.28  ...         2.8750            162500.0
8.0            -122.50     37.79  ...        15.0001            500001.0
2.0            -117.79     35.21  ...         2.3750            137500.0

[17000 rows x 8 columns]